monkey/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -1.25;
xmax 2.75;
ymin -0.75;
ymax 0.75;
zmin -0.75;
zmax 0.75;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
	
	($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 15 15) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 4 7 3)
        );
    }
	
	outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
        );
    }
	
	airSlip
    {
        type patch;
        faces
        (
			(0 4 5 1) // bottom
			(3 7 6 2) // top
			(0 1 2 3) // back
			(4 5 6 7) // front			
        );
    }
	
);

// ************************************************************************* //
